PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_i2c.h
typedef enum {
    HAL_I2C_INIT_STRUCT,                                                       /*!< I2C initialize structure */
    HAL_I2C_DEV_STRUCT,                                                        /*!< I2C device information structure */
    HAL_I2C_IRQ_STRUCT,                                                        /*!< I2C device interrupt callback function pointer structure */
} hal_i2c_struct_type_enum;

#define I2C_BUSY_TIMEOUT                    ((uint32_t)10000)                  /* 10s timeout */
#define I2C_TIMEOUT                         ((uint32_t)100000)                 /* 100s timeout */
#define I2C_ADDR_TIMEOUT                    ((uint32_t)10000)                  /* 10s timeout */

/* I2C error state */
#define HAL_I2C_ERROR_NONE                  0U                                 /*!< no error */
#define HAL_I2C_ERROR_BERR                  BIT(0)                             /*!< bus error */
#define HAL_I2C_ERROR_LOSTARB               BIT(1)                             /*!< arbitration lost in master mode */
#define HAL_I2C_ERROR_AERR                  BIT(2)                             /*!< acknowledge error */
#define HAL_I2C_ERROR_OUERR                 BIT(3)                             /*!< over-run error */
#define HAL_I2C_ERROR_PECERR                BIT(4)                             /*!< PEC error */
#define HAL_I2C_ERROR_DMATX                 BIT(7)                             /*!< DMA TX error */
#define HAL_I2C_ERROR_DMARX                 BIT(8)                             /*!< DMA RX error */

/* I2C previous state */
#define HAL_I2C_PREVIOUS_STATE_NONE         0U                                 /*!< default value */
#define HAL_I2C_PREVIOUS_STATE_TX           BIT(0)                             /*!< the last communication is TX */
#define HAL_I2C_PREVIOUS_STATE_RX           BIT(1)                             /*!< the last communication is RX */

/* I2C frame flag in serial transfer */
#define I2C_NO_OPTION_TRANSFER              ((uint16_t)0x0001U)                /*!< there is only one frame in serial transfer */
#define I2C_FIRST_TRANSFER                  ((uint16_t)0x0002U)                /*!< first frame in serial transfer */
#define I2C_LAST_TRANSFER                   ((uint16_t)0x0003U)                /*!< last frame in serial transfer */
#define I2C_NEXT_TRANSFER                   ((uint16_t)0x0004U)                /*!< next frame in serial transfer, there are at least there frames in serial transfer */

#define I2C_MEMORY_ADDRESS_8BIT             ((uint16_t)0x0000U)                /*!< memory address is 8 bits */
#define I2C_MEMORY_ADDRESS_16BIT            ((uint32_t)0x0001U)                /*!< memory address is 16 bits */

typedef struct {
    __IO uint8_t *buffer;                                                      /*!< pointer to transfer buffer */
    __IO uint32_t length;                                                      /*!< transfer length */
    __IO uint32_t pos;                                                         /*!< transfer position */
} i2c_buffer_struct;

typedef struct {
    hal_irq_handle_cb event_handle;                                            /*!< event callback function */
    hal_irq_handle_cb error_handle;                                            /*!< error callback function */
} hal_i2c_irq_struct;

typedef enum {
    HAL_I2C_STATE_READY,                                                       /*!< I2C is ready for use */
    HAL_I2C_STATE_BUSY,                                                        /*!< I2C transfer process is ongoing */
    HAL_I2C_STATE_MEMORY_BUSY_TX,                                              /*!< I2C write memory process is ongoing */
    HAL_I2C_STATE_MEMORY_BUSY_RX,                                              /*!< I2C read memory process is ongoing */
    HAL_I2C_STATE_LISTEN,                                                      /*!< I2C addressing listen is ongoing in slave mode */
    HAL_I2C_STATE_BUSY_LISTEN                                                  /*!< I2C addressing listen and data transfer is ongoing */
} hal_i2c_run_state_enum;

typedef struct{
    uint32_t                        device_address;                            /*!< device address */
    uint16_t                        memory_address;                            /*!< memory address */
    uint16_t                        address_size;                              /*!< memory address size */
    FlagStatus                      address_complete;                          /*!< addressing complete flag, initialize to RESET */
    uint8_t                         address_count;                             /*!< address count, initialize to 0 */
    FlagStatus                      second_addressing;                         /*!< initialize to RESET */
} hal_i2c_slave_address_struct;

typedef struct {
    uint32_t                        periph;                                    /*!< I2C port */
    hal_i2c_irq_struct              i2c_irq;                                   /*!< device interrupt callback function pointer */
    hal_dma_dev_struct              *p_dma_rx;                                 /*!< DMA receive pointer */
    hal_dma_dev_struct              *p_dma_tx;                                 /*!< DMA transmit pointer */
    i2c_buffer_struct               txbuffer;                                  /*!< transmit buffer */
    i2c_buffer_struct               rxbuffer;                                  /*!< receive buffer */
    hal_i2c_slave_address_struct    slave_address;                             /*!< slave address */
    __IO uint16_t                   transfer_option;                           /*!< transfer option */
    __IO uint16_t                   last_error;                                /*!< the last error code */
    __IO uint32_t                   error_state;                               /*!< error state */
    __IO hal_i2c_run_state_enum     tx_state;                                  /*!< transmit state */
    __IO hal_i2c_run_state_enum     rx_state;                                  /*!< receive state */
    __IO uint32_t                   previous_state;                            /*!< previous state */
    void                            *rx_callback;                              /*!< receive callback function pointer */
    void                            *tx_callback;                              /*!< transmit callback function pointer */
    hal_mutex_enum                  mutex;                                     /*!< mutex locked and unlocked state */
} hal_i2c_dev_struct;

typedef void (*hal_i2c_user_cb)(hal_i2c_dev_struct *i2c_dev);

/* I2C register bit mask */
#define I2CCLK_MAX                    ((uint32_t)0x0000007FU)             /*!< i2cclk maximum value */
#define I2CCLK_MIN                    ((uint32_t)0x00000002U)             /*!< i2cclk minimum value */
#define I2C_FLAG_MASK                 ((uint32_t)0x0000FFFFU)             /*!< i2c flag mask */
#define I2C_ADDRESS_MASK              ((uint32_t)0x000003FFU)             /*!< i2c address mask */
#define I2C_ADDRESS2_MASK             ((uint32_t)0x000000FEU)             /*!< the second i2c address mask */

/* I2C register bit offset */
#define STAT1_PECV_OFFSET             ((uint32_t)8U)     /* bit offset of PECV in I2C_STAT1 */

/* I2C DMA mode configure */
/* DMA mode switch */
#define I2C_DMA_ON                    I2C_CTL1_DMAON                           /*!< DMA mode enabled */
#define I2C_DMA_OFF                   ((uint32_t)0x00000000U)                  /*!< DMA mode disabled */

/* flag indicating DMA last transfer */
#define I2C_DMALST_ON                 I2C_CTL1_DMALST                          /*!< next DMA EOT is the last transfer */
#define I2C_DMALST_OFF                ((uint32_t)0x00000000U)                  /*!< next DMA EOT is not the last transfer */

/* SMBus/I2C mode switch and SMBus type selection */
#define I2C_I2CMODE_ENABLE            ((uint32_t)0x00000000U)                  /*!< I2C mode */
#define I2C_SMBUSMODE_ENABLE          I2C_CTL0_SMBEN                           /*!< SMBus mode */

/* I2C transfer direction */
#define I2C_RECEIVER                  ((uint32_t)0x00000001U)                  /*!< receiver */
#define I2C_TRANSMITTER               ((uint32_t)0xFFFFFFFEU)                  /*!< transmitter */

/* whether or not to send an ACK */
#define I2C_ACK_DISABLE               ((uint32_t)0x00000000U)                  /*!< ACK will be not sent */
#define I2C_ACK_ENABLE                I2C_CTL0_ACKEN                           /*!< ACK will be sent */

/* I2C POAP position*/
#define I2C_ACKPOS_CURRENT            ((uint32_t)0x00000000U)                  /*!< ACKEN bit decides whether or not to send ACK or not for the current byte */
#define I2C_ACKPOS_NEXT               I2C_CTL0_POAP                            /*!< ACKEN bit decides whether or not to send ACK for the next byte */

/* software reset I2C */
#define I2C_SRESET_RESET              ((uint32_t)0x00000000U)                  /*!< I2C is not under reset */
#define I2C_SRESET_SET                I2C_CTL0_SRESET                          /*!< I2C is under reset */

/* issue or not alert through SMBA pin */
#define I2C_SALTSEND_DISABLE          ((uint32_t)0x00000000U)                  /*!< not issue alert through SMBA */
#define I2C_SALTSEND_ENABLE           I2C_CTL0_SALT                            /*!< issue alert through SMBA pin */

/* transmit I2C data */
#define DATA_TRANS(regval)            (BITS(0,7) & ((uint32_t)(regval) << 0))

