PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Include/gd32f3x0_hal_i2c.h
/* receive I2C data */
#define DATA_RECV(regval)             GET_BITS((uint32_t)(regval), 0, 7)

/* I2C settings*/
/* @PARA: i2c_init */
/* @STRUCT: I2C init struct */
typedef struct {
    uint32_t clock_speed;       /*!< I2C clock speed */
    uint32_t duty_cycle;        /*!< duty cycle in fast mode or fast mode plus */
    uint32_t address_format;    /*!< I2C addformat, 7bits or 10bits */
    uint32_t own_address1;      /*!< I2C own address */
    uint32_t dual_address;      /*!< dual-address mode switch */
    uint32_t own_address2;      /*!< I2C own address2 in dual-address mode */
    uint32_t general_call;      /*!< whether or not to response to a general call */
    uint32_t no_stretch;        /*!< whether to stretch SCL low when data is not ready in slave mode */
}hal_i2c_init_struct;

/* @STRUCT_MEMBER: duty_cycle */
/* @DEFINE: duty cycle in fast mode or fast mode plus */
#define I2C_DTCY_2                    ((uint32_t)0x00000000U)                  /*!< Tlow/Thigh = 2 in I2C fast mode or fast mode plus */
#define I2C_DTCY_16_9                 I2C_CKCFG_DTCY                           /*!< Tlow/Thigh = 16/9 in I2C fast mode or fast mode plus */

/* @STRUCT_MEMBER: clock_speed */
/* @=NULL */

/* @STRUCT_MEMBER: address_format*/
/* @DEFINE: I2C clock speed */
#define I2C_ADDFORMAT_7BITS           ((uint32_t)0x00000000U)                  /*!< address format is 7 bits */
#define I2C_ADDFORMAT_10BITS          I2C_SADDR0_ADDFORMAT                     /*!< address format is 10 bits */

/* @STRUCT_MEMBER: own_address1 */
/* @=NULL */

/* @STRUCT_MEMBER: dual_address */
/* @DEFINE: dual-address mode switch  */
#define I2C_DUADEN_DISABLE                  ((uint32_t)0x00000000U)            /*!< dual-address mode disabled */
#define I2C_DUADEN_ENABLE                   I2C_SADDR1_DUADEN                  /*!< dual-address mode enabled */

/* @STRUCT_MEMBER: own_address2 */
/* @=NULL */

/* @STRUCT_MEMBER: general_call */
/* @DEFINE: whether or not to response to a general call */
#define I2C_GCEN_ENABLE               I2C_CTL0_GCEN                            /*!< slave will response to a general call */
#define I2C_GCEN_DISABLE              ((uint32_t)0x00000000U)                  /*!< slave will not response to a general call */

/* @STRUCT_MEMBER: no_stretch */
/* @DEFINE: whether to stretch SCL low when data is not ready in slave mode */
#define I2C_SCLSTRETCH_ENABLE         ((uint32_t)0x00000000U)                  /*!< SCL stretching is enabled */
#define I2C_SCLSTRETCH_DISABLE        I2C_CTL0_SS                              /*!< SCL stretching is disabled */

/* function declarations */
/* @FUNCTION: initialize the I2C structure with the default values  */
void hal_i2c_struct_init(hal_i2c_struct_type_enum struct_type, void *p_struct);

/* @FUNCTION: deinitialize I2C  */
void hal_i2c_deinit(hal_i2c_dev_struct *i2c_dev);

/* @FUNCTION: initialize I2C */
int32_t hal_i2c_init(hal_i2c_dev_struct *i2c_dev, uint32_t periph, hal_i2c_init_struct *i2c_init); 
/* @END */

/* I2C error interrupt handler */
void hal_i2c_error_irq(hal_i2c_dev_struct *i2c_dev);
/* I2C event interrupt handler */
void hal_i2c_event_irq(hal_i2c_dev_struct *i2c_dev);
/* start I2C module function */
void hal_i2c_start(hal_i2c_dev_struct *i2c_dev);
/* stop I2C module function */
void hal_i2c_stop(hal_i2c_dev_struct *i2c_dev);
/* set user-defined interrupt callback function, 
which will be registered and called when corresponding interrupt be triggered */
void hal_i2c_irq_handle_set(hal_i2c_dev_struct *i2c_dev, hal_i2c_irq_struct *p_irq);
/* reset all user-defined interrupt callback function, 
which will be registered and called when corresponding interrupt be triggered */
void hal_i2c_irq_handle_all_reset(hal_i2c_dev_struct *i2c_dev);

/* transmit amounts of data in master mode, poll transmit process and completed status,
 the function is blocking */
int32_t hal_i2c_master_transmit_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                uint32_t length, uint32_t timeout_ms);
/* receive amounts of data in master mode, poll receive process and completed status,
the function is blocking */
int32_t hal_i2c_master_receive_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                    uint32_t length, uint32_t timeout_ms);
/* transmit amounts of data in slave mode, poll transmit process and completed status,
the function is blocking */
int32_t hal_i2c_slave_transmit_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                    uint32_t length, uint32_t timeout_ms);
/* receive amounts of data in slave mode, poll receive process and completed status,
the function is blocking */
int32_t hal_i2c_slave_receive_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                               uint32_t length, uint32_t timeout_ms);
/* write amounts of data to memory, poll transmit process and completed status,
the function is blocking */
int32_t hal_i2c_memory_write_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                              uint32_t length, uint32_t timeout_ms);
/* read amounts of data from memory, poll transmit process and completed status,
the function is blocking */
int32_t hal_i2c_memory_read_poll(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                              uint32_t length, uint32_t timeout_ms);
/* transmit amounts of data in master mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_master_transmit_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                    uint32_t length, hal_i2c_user_cb p_user_func);
/* receive amounts of data in master mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_master_receive_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer,\
                                        uint32_t length, hal_i2c_user_cb p_user_func);
/* transmit amounts of data in slave mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_slave_transmit_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer,\
                                    uint32_t length, hal_i2c_user_cb p_user_func);
/* receive amounts of data in slave mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_slave_receive_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer,\
                                    uint32_t length, hal_i2c_user_cb p_user_func);
/* write amounts of data to memory by interrupt method,the function is non-blocking */
int32_t hal_i2c_memory_write_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                              uint32_t length, hal_i2c_user_cb p_user_func);
/* read amounts of data from memory by interrupt method,the function is non-blocking */
int32_t hal_i2c_memory_read_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                              uint32_t length, hal_i2c_user_cb p_user_func);
/* transmit amounts of data in master mode by dma method,the function is non-blocking */
int32_t hal_i2c_master_transmit_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                               uint32_t length, hal_i2c_user_cb p_user_func);
/* receive amounts of data in master mode by dma method,the function is non-blocking */
int32_t hal_i2c_master_receive_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                               uint32_t length, hal_i2c_user_cb p_user_func);
/* transmit amounts of data in slave mode by dma method,the function is non-blocking */
int32_t hal_i2c_slave_transmit_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                               uint32_t length, hal_i2c_user_cb p_user_func);
/* receive amounts of data in slave mode by dma method,the function is non-blocking */
int32_t hal_i2c_slave_receive_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                               uint32_t length, hal_i2c_user_cb p_user_func);
/* write amounts of data to memory by dma method,the function is non-blocking */
int32_t hal_i2c_memory_write_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                              uint32_t length, hal_i2c_user_cb p_user_func);
/* read amounts of data from memory by dma method,the function is non-blocking */
int32_t hal_i2c_memory_read_dma(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                              uint32_t length, hal_i2c_user_cb p_user_func);
/* check whether the device is ready for access */
int32_t hal_i2c_device_ready_check(hal_i2c_dev_struct *i2c_dev, uint32_t timeout_ms);
/* serial transmit amounts of data in master mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_master_serial_transmit_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                    uint32_t length, hal_i2c_user_cb p_user_func);
/* serial receive amounts of data in master mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_master_serial_receive_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer, \
                                    uint32_t length, hal_i2c_user_cb p_user_func);
/* serial transmit amounts of data in slave mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_slave_serial_transmit_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer,\
                                    uint32_t length, hal_i2c_user_cb p_user_func);
/* serial receive amounts of data in slave mode by interrupt method,the function is non-blocking */
int32_t hal_i2c_slave_serial_receive_interrupt(hal_i2c_dev_struct *i2c_dev, uint8_t *p_buffer,\
                                    uint32_t length, hal_i2c_user_cb p_user_func);
/* enable address listen in slave mode by interrupt method */
int32_t hal_i2c_address_listen_interrupt_enable(hal_i2c_dev_struct *i2c_dev, hal_i2c_user_cb p_user_func);
/* disable address listen in slave mode by interrupt method */
int32_t hal_i2c_address_listen_interrupt_disable(hal_i2c_dev_struct *i2c_dev);

/* configure I2C clock */
void hals_i2c_clock_config(uint32_t i2c_periph, uint32_t clkspeed, uint32_t dutycyc);
/* configure I2C address */
void hals_i2c_mode_addr_config(uint32_t i2c_periph, uint32_t mode, uint32_t addformat, uint32_t addr);
/* whether or not to send an ACK */
void hals_i2c_ack_config(uint32_t i2c_periph, uint32_t ack);
/* configure I2C POAP position */
void hals_i2c_ackpos_config(uint32_t i2c_periph, uint32_t pos);
/* master sends slave address */
void hals_i2c_master_addressing(uint32_t i2c_periph, uint32_t addr, uint32_t trandirection);
/* enable dual-address mode */
void hals_i2c_dualaddr_enable(uint32_t i2c_periph, uint32_t addr);
/* disable dual-address mode */
void hals_i2c_dualaddr_disable(uint32_t i2c_periph);
/* whether to stretch SCL low when data is not ready in slave mode */
void hals_i2c_stretch_scl_low_config(uint32_t i2c_periph, uint32_t stretchpara);
/* whether or not to response to a general call */
void hals_i2c_slave_response_to_gcall_config(uint32_t i2c_periph, uint32_t gcallpara);

/* I2C transmit data function */
void hals_i2c_data_transmit(uint32_t i2c_periph, uint8_t data);
/* I2C receive data function */
uint8_t hals_i2c_data_receive(uint32_t i2c_periph);
/* configure I2C DMA mode */
void hals_i2c_dma_config(uint32_t i2c_periph, uint32_t dmastate);
/* configure whether next DMA EOT is DMA last transfer or not */
void hals_i2c_dma_last_transfer_config(uint32_t i2c_periph, uint32_t dmalast);
/* check I2C flag is set or not */
FlagStatus hals_i2c_flag_get(uint32_t i2c_periph, i2c_flag_enum flag);
/* clear I2C flag status */
void hals_i2c_flag_clear(uint32_t i2c_periph, i2c_flag_enum flag);
/* enable I2C interrupt */
void hals_i2c_interrupt_enable(uint32_t i2c_periph, i2c_interrupt_enum interrupt);
/* disable I2C interrupt */
void hals_i2c_interrupt_disable(uint32_t i2c_periph, i2c_interrupt_enum interrupt);
/* get I2C interrupt flag status */
FlagStatus hals_i2c_interrupt_flag_get(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag);
/* clear I2C interrupt flag status */
void hals_i2c_interrupt_flag_clear(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag);

#endif /* GD32F3X0_HAL_I2C_H */
